# Lista de exercicios

O banco de dados a seguir está disponivel na web. Analise os relacionamentos apresentados no diagrama de relacionamento e responda a questões abaixo:

<img src='https://relational.fel.cvut.cz/assets/img/datasets-generated/world.svg'>

## Conexão

In [1]:
# Jupyter Notebook: Exercícios Introdutórios de SQL - Banco World

# ## Configuração da Conexão
# Vamos usar SQLAlchemy e Pandas para conectar ao banco de dados World

import pandas as pd
from sqlalchemy import create_engine

# Credenciais do banco de dados
host = 'relational.fel.cvut.cz'
port = '3306'
user = 'guest'
password = 'ctu-relational'
db = 'world'  # banco de dados World

# Criando engine de conexão
engine = create_engine(f'mysql+pymysql://{user}:{password}@{host}:{port}/{db}')

# Função auxiliar para executar query e mostrar resultado
def run_query(query):
    return pd.read_sql(query, engine)

## Exercicios

**Exemplo**

In [3]:
# ------------------------------------------------------
# 1. Consultas Simples
# Tarefas:
# 1.1 Liste os 10 primeiros países com o nome e população.
query1 = 'SELECT Name, Population FROM Country LIMIT 10;'
df1 = run_query(query1)
df1

                   Name  Population
0                 Aruba      103000
1           Afghanistan    22720000
2                Angola    12878000
3              Anguilla        8000
4               Albania     3401200
5               Andorra       78000
6  Netherlands Antilles      217000
7  United Arab Emirates     2441000
8             Argentina    37032000
9               Armenia     3520000

**Agora é sua vez**

In [15]:
### Consultas simples
# 1.2 Liste 10 cidades ordenadas pelo nome e mostre também o código do país.
query2 = 'SELECT Name, CountryCode FROM City ORDER BY 1 LIMIT 10'
df2 = run_query(query2)
df2

                   Name CountryCode
0  A Coruña (La Coruña)         ESP
1                Aachen         DEU
2               Aalborg         DNK
3                   Aba         NGA
4                Abadan         IRN
5            Abaetetuba         BRA
6                Abakan         RUS
7            Abbotsford         CAN
8              Abeokuta         NGA
9              Aberdeen         GBR

In [ ]:

# 1.3 Conte quantos países existem no banco de dados.
query3 = 'SELECT COUNT(*) FROM Country'
df3 = run_query(query3)
df3

   COUNT(*)
0       239

In [ ]:
###  Filtros e Condições
# 2.1 Liste países com população maior que 100 milhões.
q4 = 'SELECT Name FROM Country WHERE Population > 100000000'
df4 = run_query(q4)
df4

                 Name
0          Bangladesh
1              Brazil
2               China
3           Indonesia
4               India
5               Japan
6             Nigeria
7            Pakistan
8  Russian Federation
9       United States

In [ ]:
# 2.2 Liste cidades cujo nome contém 'San'. 
q5 = 'SELECT Name FROM City WHERE Name LIKE "%%San%%"'
df5 = run_query(q5)
df5

                      Name
0    San Miguel de Tucumán
1       General San Martín
2                 Santa Fé
3               San Isidro
4               San Miguel
..                     ...
141            Santa Clara
142                  Sandy
143       San Buenaventura
144              San Mateo
145           Santa Monica

[146 rows x 1 columns]

In [9]:
# 2.3 Liste 10 países do continente Ásia.

q6 = 'SELECT Name FROM Country WHERE Continent LIKE "ASIA" LIMIT 10'
df6 = run_query(q6)
df6

                   Name
0           Afghanistan
1  United Arab Emirates
2               Armenia
3            Azerbaijan
4            Bangladesh
5               Bahrain
6                Brunei
7                Bhutan
8                 China
9                Cyprus

In [5]:
### Ordenação

# 3.1 Liste os 10 países mais populosos.
q7 = 'SELECT Name, Population FROM Country ORDER BY 2 DESC LIMIT 10'
df7 = run_query(q7)
df7

                 Name  Population
0               China  1277558000
1               India  1013662000
2       United States   278357000
3           Indonesia   212107000
4              Brazil   170115000
5            Pakistan   156483000
6  Russian Federation   146934000
7          Bangladesh   129155000
8               Japan   126714000
9             Nigeria   111506000

In [3]:
### Funções Agregadas

# 4.1 Conte quantos países existem por continente.
q8 = 'SELECT Continent, COUNT(DISTINCT Name) FROM Country GROUP BY 1'
df8 = run_query(q8)
df8

       Continent  COUNT(DISTINCT Name)
0           Asia                    51
1         Europe                    46
2  North America                    37
3         Africa                    58
4        Oceania                    28
5     Antarctica                     5
6  South America                    14

In [ ]:
###  JOINs
# 5.2 Liste todas as cidades do país França.
q9 = 'SELECT City.Name FROM City INNER JOIN Country ON City.CountryCode = Country.Code WHERE Country.Name = "France"'
df9 = run_query(q9)
df9

                    Name
0                  Paris
1              Marseille
2                   Lyon
3               Toulouse
4                   Nice
5                 Nantes
6             Strasbourg
7            Montpellier
8               Bordeaux
9                 Rennes
10              Le Havre
11                 Reims
12                 Lille
13            St-Étienne
14                Toulon
15              Grenoble
16                Angers
17                 Dijon
18                 Brest
19               Le Mans
20      Clermont-Ferrand
21                Amiens
22       Aix-en-Provence
23               Limoges
24                 Nîmes
25                 Tours
26          Villeurbanne
27                  Metz
28              Besançon
29                  Caen
30               Orléans
31              Mulhouse
32                 Rouen
33  Boulogne-Billancourt
34             Perpignan
35                 Nancy
36               Roubaix
37            Argenteuil
38             Tourcoing
39             Montreuil

In [3]:
# 5.3 Liste 10 países com o número de cidades em cada um, em ordem decrescente.
q10 = 'SELECT Country.Name, COUNT(City.ID) FROM Country LEFT JOIN City ON Country.Code = City.CountryCode GROUP BY Country.Name ORDER BY COUNT(City.ID) DESC LIMIT 10'
df10 = run_query(q10)
df10

                 Name  COUNT(City.ID)
0               China             363
1               India             341
2       United States             274
3              Brazil             250
4               Japan             248
5  Russian Federation             189
6              Mexico             173
7         Philippines             136
8             Germany              93
9           Indonesia              85